app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
SELECT "artists".* FROM "artists" WHERE "artists"."artist_id" = ?  [["artist_id", "#<Song::ActiveRecord_Associations_CollectionProxy:0x00007fa21a4d8938>"]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def index
    @songs = Song.all
    if params[:artist_id]
      if Artist.find_by(id: params[:artist_id]).nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @songs = Artist.find_by(id: params[:artist_id]).songs

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    if params[:artist_id]
      if Song.find_by(id: params[:id]).nil?
        @artist = Artist.find_by(id: params[:artist_id])

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "This is a Song"], ["created_at", "2020-09-09 19:24:25.845954"], ["updated_at", "2020-09-09 19:24:25.845954"], ["artist_id", 5]]
---
  def create
    @song = Song.new(song_params)

    if @song.save